[
  {
    "code": "AD115",
    "name": "Design StudioI 人因工程與設計 另類DIY文創微學程",
    "description": "In this hands-on studio course, AD115: Design Studio I 人因工程與設計 另類DIY文創微學程, students engage with the principles of human-centered design, exploring innovative DIY approaches to creative problem-solving and product development. Through a series of design projects and workshops, students develop essential skills in design thinking, user research, and prototyping, applying them to real-world challenges and emerging technologies. By the end of the course, students will have a foundational understanding of design principles and practices, as well as the creative confidence to tackle complex problems in a rapidly changing world.",
    "taught_in_english": false
  },
  {
    "code": "AD116",
    "name": "Design StudioII",
    "description": "In this practical design course, students will apply theoretical concepts to real-world problems through hands-on projects and collaborative group work. Taught in Spanish, AD116 Design Studio II covers the development of visual communication, spatial design, and creative problem-solving skills, culminating in a comprehensive design project. Students will refine their critical thinking, creativity, and technical skills to produce innovative and effective design solutions.",
    "taught_in_english": false
  },
  {
    "code": "AD117",
    "name": "Art StudioI",
    "description": "\"AD117: Art Studio I, se ofrece en español. En este curso, los estudiantes exploran las habilidades básicas de la creación artística a través de la experimentación con diferentes medios y técnicas, desarrollando sus habilidades visuales y críticas a la obra de arte. A lo largo del semestre, los estudiantes crearán una variedad de obras que aborden conceptos y temas artísticos fundamentales.\"",
    "taught_in_english": false
  },
  {
    "code": "AD118",
    "name": "Art StudioII",
    "description": "\"AD118 - Art Studio II: Este curso es una continuación de los conceptos y habilidades desarrollados en el curso previo de Estudio de Arte. Los estudiantes explorarán técnicas y materiales avanzados para desarrollar su habilidad creativa, analizarán obras de arte contemporáneo y crearán proyectos individuales que demuestran su comprensión de los principios artísticos. Al finalizar el curso, los estudiantes habrán mejorado significativamente su habilidad para expresar ideas visuales a través de la pintura, escultura y otros medios.\"",
    "taught_in_english": false
  },
  {
    "code": "AD149",
    "name": "Body Aesthetics",
    "description": "In this course, AD149 \"Body Aesthetics,\" students will explore the complex relationship between culture, society, and bodily appearance, examining the historical and contemporary contexts that shape beauty standards and bodily norms. Through in-depth analysis and critical discussions, students will develop a nuanced understanding of the social, cultural, and philosophical factors that influence the way we perceive and experience the body.",
    "taught_in_english": false
  },
  {
    "code": "AD153",
    "name": "Drawing",
    "description": "This course, AD153 Drawing, introduces students to the fundamental techniques and principles of visual representation through drawing. Students will learn to observe, record, and communicate their understanding of the world through various drawing mediums, developing their skills in form, space, value, and texture. Through hands-on practice and critical analysis, students will refine their artistic expression and technical skills in this comprehensive drawing course taught in [insert language].",
    "taught_in_english": false
  },
  {
    "code": "AD249",
    "name": "Animation Theory and Practice",
    "description": "This course, Animation Theory and Practice (AD249), is a comprehensive exploration of the principles and techniques underlying animation. Students will delve into the theoretical foundations of animation, examining the historical, cultural, and artistic contexts that inform its practice, while also developing hands-on skills in animation production. Through a combination of lectures, workshops, and project-based learning, students will gain a nuanced understanding of animation's role in storytelling and visual communication.",
    "taught_in_english": false
  },
  {
    "code": "AD250",
    "name": "2D Computer Drawing Teaching in English",
    "description": "In this hands-on course, AD250: 2D Computer Drawing Teaching in English, students will develop their skills in creating and visualizing 2D digital art using industry-standard software. Through a combination of lectures, demonstrations, and practical exercises, students will gain a comprehensive understanding of digital drawing principles, techniques, and best practices. By the end of the course, students will be able to create polished 2D digital artwork and confidently communicate their ideas through effective visual storytelling.",
    "taught_in_english": true
  },
  {
    "code": "AD251",
    "name": "3D Computer Drawing Teaching in English",
    "description": "In this course, AD251: 3D Computer Drawing Teaching in English, students will learn the fundamentals of 3D computer-aided design, visualization, and animation techniques using industry-standard software. Through hands-on projects and lectures, students will develop their skills in creating 3D models, textures, and lighting effects for various applications in architecture, engineering, and design fields. The course emphasizes effective communication of 3D designs in English, preparing students for careers in teaching or industry.",
    "taught_in_english": true
  },
  {
    "code": "AD279",
    "name": "Contemporary Sketch",
    "description": "In this course (AD279), students will explore the fundamental techniques and mediums of contemporary sketching, delving into the nuances of line, value, and texture. Through a series of hands-on exercises and projects, students will develop their observation and communication skills, learning to effectively capture the essence of the human form and the natural world in various media, including graphite, charcoal, and ink.",
    "taught_in_english": false
  },
  {
    "code": "AI001",
    "name": "Probability and Statistics Teaching in Internet",
    "description": "In this course, students will develop a comprehensive understanding of statistical concepts and probabilistic principles applied to the assessment and evaluation of educational data in an online learning environment. Through hands-on learning experiences and real-world case studies, students will learn to design and implement effective probability and statistics teaching methods suitable for internet-based educational settings.",
    "taught_in_english": false
  },
  {
    "code": "AI002",
    "name": "AI Ethics Teaching in Internet",
    "description": "Este curso de AI002, AI Ethics Teaching in Internet, aborda los fundamentos éticos de la enseñanza de la inteligencia artificial en el entorno del internet. Estudiantes aprenderán a analizar los impactos morales y sociales de la IA en la educación en línea y a desarrollar estrategias para incorporar consideraciones éticas en la creación de contenidos y plataformas educativas. Al finalizar el curso, los estudiantes estarán capacitados para diseñar y implementar soluciones de IA éticas y responsables en entornos educativos.",
    "taught_in_english": false
  },
  {
    "code": "AM556",
    "name": "Exhibition and Curator",
    "description": "In this comprehensive course (AM556), students delve into the theoretical and practical aspects of exhibition and curatorship, exploring the complexities of visual display and the role of the curator in shaping audience experience. Through a combination of lectures, discussions, and hands-on projects, students develop a deep understanding of exhibition design, curation strategies, and the cultural context of exhibition-making. Upon completion, students will be equipped to design, produce, and evaluate exhibitions that engage diverse audiences and promote meaningful cultural exchange.",
    "taught_in_english": false
  },
  {
    "code": "AM582",
    "name": "Art and Design Creation ExecutionI",
    "description": "This course, Art and Design Creation Execution I, provides students with a comprehensive introduction to the principles and practices of art and design creation. Through hands-on projects and collaborative activities, students will develop their creative skills, learn to effectively communicate their ideas, and execute their design concepts. By the end of the course, students will have a solid foundation in the technical, aesthetic, and critical aspects of art and design creation.",
    "taught_in_english": false
  },
  {
    "code": "AM584",
    "name": "Professional Practice Community Art Festival Curation and Execution",
    "description": "In this interdisciplinary course, AM584, students will delve into the complexities of curating and executing a professional community art festival, exploring the intersection of arts management, community engagement, and cultural programming. Through project-based learning and collaborative workshops, students will develop the skills and knowledge necessary to conceptualize, plan, and implement a successful art festival that fosters community connection and cultural exchange. By the end of the course, students will have a comprehensive understanding of the festival curation and execution process.",
    "taught_in_english": false
  },
  {
    "code": "AM601",
    "name": "Taiwanese Art History",
    "description": "This course provides an in-depth examination of the development and evolution of art in Taiwan, from pre-colonial to contemporary periods. Students will analyze key artworks, artists, and cultural movements, exploring the historical and social contexts that have shaped Taiwanese art. Through a critical and interdisciplinary approach, students will gain a nuanced understanding of Taiwan's rich artistic heritage.",
    "taught_in_english": false
  },
  {
    "code": "AM603",
    "name": "Visual Arts Administration",
    "description": "\"AM603 Visual Arts Administration: Este curso ofrece una visión integral de la gestión de arte visual, abordando temas como la planificación y gestión de exposiciones, marketing y promoción de arte, financiamiento y recursos para proyectos artísticos, y la regulación y ética en la industria del arte. Los estudiantes aprenderán a analizar y solucionar problemas en entornos complejos de arte visual, y desarrollarán habilidades prácticas para liderar y trabajar en equipos en el sector del arte. A través de seminarios, talleres y proyectos, los estudiantes aplicarán teorías y conceptos a casos reales de la industria del arte visual.\"",
    "taught_in_english": false
  },
  {
    "code": "AM613",
    "name": "Research Methodology and Paper Writing",
    "description": "In this course, AM613, students will develop a comprehensive understanding of research methodologies and techniques, with a focus on practical application in academic writing. Through a series of lectures and assignments, students will learn to design, conduct, and critically evaluate research, as well as develop their skills in writing clear and effective academic papers in Spanish.",
    "taught_in_english": false
  },
  {
    "code": "AM622",
    "name": "Contemporary Art",
    "description": "\"Esta asignatura, AM622, explora la evolución contemporánea del arte, desde la segunda mitad del siglo XX hasta la actualidad. A través de debates teóricos, críticas de arte y proyectos creativos, los estudiantes analizarán las tendencias y movimientos artísticos más relevantes, así como las relaciones entre el arte y la sociedad en la era digital. Al finalizar el curso, los estudiantes tendrán una comprensión profunda de los procesos creativos y críticos que definen la escena artística contemporánea.\"",
    "taught_in_english": false
  },
  {
    "code": "AM654",
    "name": "Museum development and current issues",
    "description": "This course examines the contemporary challenges and trends in museum development, exploring the intersections of cultural policy, community engagement, and institutional management. Students will analyze case studies from around the world, developing a nuanced understanding of the complexities involved in museum operations and strategic decision-making.",
    "taught_in_english": false
  },
  {
    "code": "AM656",
    "name": "Studies for Exhibition and Practice in Contemporary Visual Art",
    "description": "In this interdisciplinary course, AM656, students delve into the theoretical and practical aspects of contemporary visual art, exploring various mediums and contexts to develop a deeper understanding of exhibition and practice in the field. Through lectures, critiques, and projects, students learn to critically evaluate artistic expressions, develop their own creative vision, and refine their skills in curating and exhibiting art.",
    "taught_in_english": false
  },
  {
    "code": "AM657",
    "name": "Art and Cultural Industry 創新產品開發學程 創新產品開發學程",
    "description": "This course, Art and Cultural Industry 創新產品開發學程, focuses on the development and implementation of innovative products in the art and cultural industry. Students will learn to integrate creative thinking, market analysis, and project management skills to design and launch successful cultural products and services. Through hands-on experiences and case studies, students will develop a comprehensive understanding of the industry's trends, challenges, and opportunities.",
    "taught_in_english": false
  },
  {
    "code": "AM660",
    "name": "Cultural Creativity and Placemaking",
    "description": "This course explores the transformative power of art, culture, and community engagement in shaping public spaces and revitalizing urban environments. Through a critical examination of placemaking theories, students will learn to analyze the intersections of creativity, identity, and place-making practices, and develop strategies for inclusive, participatory, and culturally sensitive urban design.",
    "taught_in_english": false
  },
  {
    "code": "BI519",
    "name": "Fermentation Engineering",
    "description": "\"BI519 Fermentation Engineering: In diesem Kurs werden die grundlegenden Prinzipien der Fermentationstechnik, einschließlich Mikrobiologie, Biochemie und Verfahrenstechnik, behandelt. Studierende erwerben Kenntnisse über die Entstehung von Lebensmitteln und Arzneimitteln sowie die Entwicklung von biotechnologischen Verfahren zur Optimierung von Fermentationsprozessen. Durch praktische Übungen und Fallstudien werden die theoretischen Konzepte auf industrielle Anwendungen angewendet.\"",
    "taught_in_english": false
  },
  {
    "code": "BI522",
    "name": "Bioprocessing Engineering",
    "description": "Este curso de Ingeniería de Bioprocésos (BI522) ofrece una visión integral de los principios y técnicas utilizados en la ingeniería de procesos biológicos, desde la selección de microorganismos hasta la implementación de plantas de producción a escala industrial. A lo largo de este curso, los estudiantes aprenderán a diseñar y optimizar procesos biológicos, integrando conceptos de biotecnología, ingeniería química y gestión de procesos para resolver problemas complejos en la industria biotecnológica. Al finalizar el curso, los estudiantes dispondrán de habilidades prácticas y teóricas para desem",
    "taught_in_english": false
  },
  {
    "code": "BI531",
    "name": "Biostatistics",
    "description": "BI531: Biostatistics - \nEsta asignatura proporciona una introducción teórica y práctica a las estadísticas en la investigación biomédica, donde los estudiantes aprenderán a analizar y interpretar datos para tomar decisiones informadas en la salud pública, epidemiología y investigación clínica. A lo largo de la asignatura, los estudiantes desarrollarán habilidades en modelado estadístico, diseño de estudios y análisis de datos, preparándolos para aplicarlos en diversas disciplinas biomédicas.",
    "taught_in_english": false
  },
  {
    "code": "BI544",
    "name": "Molecular Genetics Teaching in English",
    "description": "In this advanced course, students will delve into the principles and applications of molecular genetics, exploring the molecular mechanisms underlying genetic inheritance and variation. Through lectures and discussions, students will develop a comprehensive understanding of genetic engineering, gene expression, and genomics, with a focus on teaching and communicating complex concepts effectively in English.",
    "taught_in_english": true
  },
  {
    "code": "BI546",
    "name": "Clinical Medicine",
    "description": "\"This course, BI546 Clinical Medicine, is an advanced undergraduate program that delves into the theoretical and practical aspects of medical practice, focusing on the diagnosis, treatment, and management of various diseases and conditions. Through a combination of lectures, case studies, and clinical rotations, students will develop a comprehensive understanding of the human body and the principles of clinical medicine, including pharmacology, pathology, and evidence-based medicine. Upon completion, students will be equipped to apply their knowledge in real-world medical settings.\"",
    "taught_in_english": false
  },
  {
    "code": "BI562",
    "name": "Exploring Biotechnology Teaching in English",
    "description": "This course, BI562 Exploring Biotechnology Teaching in English, equips students with the theoretical foundations and practical skills necessary to design and deliver effective biotechnology education in an English-speaking environment. Through interactive lectures, discussions, and hands-on activities, students will develop expertise in creating engaging lesson plans, assessing student learning, and promoting scientific literacy in the context of biotechnology. By the end of the course, students will be able to critically evaluate teaching methods and develop innovative approaches to teaching biotechnology in English.",
    "taught_in_english": true
  },
  {
    "code": "BI565",
    "name": "Seminar",
    "description": "\"BI565 Seminar: En este curso, los estudiantes profundizarán en conceptos y métodos avanzados en biología, abordando temas actuales y controvertidos en el campo a través de debates, presentaciones y discusiones en grupo, permitiendo desarrollar habilidades de pensamiento crítico y comunicación efectiva.\"",
    "taught_in_english": false
  },
  {
    "code": "CB542",
    "name": "Data Mining and Its Applications in Biomedical Domains",
    "description": "This course covers Data Mining and Its Applications in Biomedical Domains. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": false
  },
  {
    "code": "CB545",
    "name": "Clinical Applications of Medical Signal and Image Teaching in English",
    "description": "This course explores the clinical applications of medical signal and image processing, focusing on the analysis and interpretation of various biomedical signals and images. Students will learn to apply theoretical concepts to real-world scenarios, developing skills in data analysis, processing, and visualization. Through a combination of lectures, case studies, and hands-on exercises, students will gain a comprehensive understanding of medical signal and image processing.",
    "taught_in_english": true
  },
  {
    "code": "CB554",
    "name": "Seminar",
    "description": "This course covers Seminar. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": false
  },
  {
    "code": "CB582",
    "name": "Big Data Analytics",
    "description": "\"This course, CB582, introduces students to the principles and practices of Big Data Analytics, exploring advanced techniques for extracting insights from large datasets. Students will learn to design and implement data pipelines, apply machine learning algorithms, and communicate results effectively. Through hands-on projects and case studies, students will develop skills in data analysis, visualization, and decision-making in a data-driven environment.\"",
    "taught_in_english": false
  },
  {
    "code": "CB584",
    "name": "Operating Systems Teaching in English",
    "description": "This course covers Operating Systems Teaching in English. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": true
  },
  {
    "code": "CB585",
    "name": "Cryptography Teaching in English",
    "description": "This course, CB585 Cryptography Teaching in English, delves into the theoretical foundations and practical applications of cryptography, enabling students to design and implement secure cryptographic protocols and systems. Through lectures and discussion, students will gain a comprehensive understanding of cryptographic techniques, including encryption algorithms, digital signatures, and key management, as well as the pedagogical skills necessary to teach cryptography effectively in English.",
    "taught_in_english": true
  },
  {
    "code": "CB586",
    "name": "Computer Networking Teaching in English",
    "description": "This course covers Computer Networking Teaching in English. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": true
  },
  {
    "code": "CB589",
    "name": "VLSI Testing & Design",
    "description": "Cette formation de niveau master couvre les principes fondamentaux de la conception et de l'implémentation de tests pour les circuits intégrés à très grande échelle (VLSI). Les étudiants apprendront les méthodes de test, les modèles de comportement des circuits, ainsi que les techniques d'optimisation pour la conception de tests efficaces.",
    "taught_in_english": false
  },
  {
    "code": "CB594",
    "name": "Cybersecurity Teaching in English",
    "description": "This course covers Cybersecurity Teaching in English. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": true
  },
  {
    "code": "CB621",
    "name": "Special topics on statistical genomics",
    "description": "\"Esta asignatura, CB621 Special topics on statistical genomics, se enfoca en el análisis y la interpretación de datos genómicos a través del uso de estadística y modelos matemáticos avanzados. Los estudiantes aprenderán a aplicar técnicas estadísticas para identificar patrones y relaciones en secuencias genómicas y a evaluar la importancia de los hallazgos en el contexto de la investigación biomédica. A través de una combinación de teoría y práctica, los estudiantes desarrollarán habilidades para analizar datos genómicos complejos y tomar decisiones informadas en la investigación y la medicina.\"",
    "taught_in_english": false
  },
  {
    "code": "CC125",
    "name": "Reading Guidance",
    "description": "This course covers Reading Guidance. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": false
  },
  {
    "code": "CC132",
    "name": "Introduction to Chinese Literature",
    "description": "This course introduces students to the rich literary heritage of China, exploring pivotal works and authors from the pre-Qin period to the present day. Students will analyze key themes, styles, and historical contexts that have shaped Chinese literature, developing a deeper understanding of the country's cultural identity and intellectual traditions. Through critical readings and discussions, students will engage with the complexities and nuances of Chinese literature, fostering their analytical and expressive skills.",
    "taught_in_english": false
  },
  {
    "code": "CC377",
    "name": "Chinese Painting一",
    "description": "This course covers Chinese Painting一. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": false
  },
  {
    "code": "CC484",
    "name": "Brief Design Introduction and Application",
    "description": "This course, CC484 Brief Design Introduction and Application, introduces students to the fundamental principles and elements of design, focusing on visual communication and creative problem-solving. Through a combination of theoretical and practical exercises, students will develop essential skills in design thinking, concept development, and project execution. Upon completion, students will be able to apply design principles to real-world scenarios and develop effective visual solutions.",
    "taught_in_english": false
  },
  {
    "code": "CC487",
    "name": "Creative Writing of Modern Chinese Literature",
    "description": "This course covers Creative Writing of Modern Chinese Literature. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": false
  },
  {
    "code": "CC489",
    "name": "Practical Guided Tour Interpretation",
    "description": "In this course, CC489 Practical Guided Tour Interpretation, students will develop skills in crafting engaging narratives and delivering effective guided tours in a multilingual setting, with a focus on Spanish-speaking markets. Through a combination of theoretical foundations and practical exercises, students will learn to analyze tour content, adapt communication styles, and create immersive experiences for diverse audiences. By the end of the course, students will be able to design and deliver guided tours that cater to the needs of international visitors.",
    "taught_in_english": false
  },
  {
    "code": "CC509",
    "name": "Special Topics in Classical Chinese Literature",
    "description": "This course covers Special Topics in Classical Chinese Literature. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": false
  },
  {
    "code": "CC523",
    "name": "Special Topics in Chinese Thoughts",
    "description": "This course delves into the complexities of traditional Chinese thought, exploring key philosophical concepts, historical developments, and cultural expressions that have shaped Chinese society and worldview. Through an in-depth examination of classical texts and contemporary interpretations, students will gain a nuanced understanding of Confucianism, Taoism, and other influential ideologies that continue to influence China's social, economic, and political landscape.",
    "taught_in_english": false
  },
  {
    "code": "CC532",
    "name": "Special Topics in Taiwan Literature",
    "description": "This course covers Special Topics in Taiwan Literature. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": false
  },
  {
    "code": "CC551",
    "name": "Special Topics Research on Modern Poems",
    "description": "This course delves into the analysis and interpretation of contemporary Chinese poetry, exploring the historical, cultural, and literary contexts that shape modern poetic expression. Students will develop their critical thinking skills, examining the intersections of social, cultural, and poetic themes in contemporary Chinese literature. Through in-depth readings and discussions, students will gain a nuanced understanding of the complexities and richness of modern Chinese poetry.",
    "taught_in_english": false
  },
  {
    "code": "CC553",
    "name": "Special Topics on the Interpretation of Confucian Canons",
    "description": "This course covers Special Topics on the Interpretation of Confucian Canons. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": false
  },
  {
    "code": "CC562",
    "name": "Special Topics on Chinese Culture",
    "description": "This course delves into the complexities and richness of Chinese Culture through in-depth examination of its history, philosophy, literature, art, and social norms. Students will engage with primary sources and contemporary texts to develop a nuanced understanding of China's cultural identity and its ongoing evolution. Through class discussions and written assignments, students will analyze the cultural dynamics that have shaped China's past, present, and future.",
    "taught_in_english": false
  },
  {
    "code": "CC569",
    "name": "Research Methodology",
    "description": "This course covers Research Methodology. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": false
  },
  {
    "code": "CC570",
    "name": "Special Topics on Ethnic Languages and Culture",
    "description": "This course, CC570 Special Topics on Ethnic Languages and Culture, provides an in-depth examination of the complexities and nuances of ethnic languages and cultures, exploring their historical contexts, linguistic characteristics, and cultural expressions. Through a multidisciplinary approach, students will gain a deeper understanding of the intersections between language, culture, and identity, as well as develop their analytical and critical thinking skills in analyzing and interpreting cultural texts.",
    "taught_in_english": false
  },
  {
    "code": "CH103",
    "name": "General Chemistry",
    "description": "This course covers General Chemistry. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": false
  },
  {
    "code": "CH105",
    "name": "General Chemistry & Analysis Laboratory",
    "description": "CH105 - General Chemistry & Analysis Laboratory: This course integrates fundamental principles of general chemistry with hands-on laboratory experience, enabling students to develop problem-solving skills through experimentation and data analysis. Students will learn to design experiments, collect and analyze data, and interpret results, applying theoretical concepts to real-world chemical phenomena. Prerequisites include a strong foundation in chemistry and proficiency in a relevant language.",
    "taught_in_english": false
  },
  {
    "code": "CH115",
    "name": "Computer ProgrammingI",
    "description": "This course covers Computer ProgrammingI. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": false
  },
  {
    "code": "CH125",
    "name": "Introduction to Chemical Engineering & Material Science",
    "description": "Este introdução ao engenharia química e à ciência dos materiais oferece uma visão geral da aplicação de princípios científicos e matemáticos para o desenvolvimento e otimização de processos, produtos e materiais. Ao longo do curso, os alunos aprenderão a fundamentos da engenharia química, incluindo processos de separação, reações químicas e transportes de massa, além da ciência dos materiais, abordando as propriedades, estrutura e aplicação de diferentes tipos de materiais.",
    "taught_in_english": false
  },
  {
    "code": "CH128",
    "name": "General PhysicsI",
    "description": "This course covers General PhysicsI. Students will learn fundamental concepts and practical applications in this field.",
    "taught_in_english": false
  },
  {
    "code": "CH129",
    "name": "General PhysicsII",
    "description": "In this intermediate-level course, CH129 General Physics II delves into the fundamental principles of mechanics, electromagnetism, and thermodynamics, building upon the foundational concepts introduced in General Physics I. Students will develop a comprehensive understanding of physical phenomena and mathematical techniques necessary to analyze and solve complex problems in these areas. Through a combination of theoretical and experimental approaches, students will gain a deeper appreciation for the underlying laws that govern the natural world.",
    "taught_in_english": false
  }
]